{
  "userInfo": { "name": "Anku", "userImg": "/userImg.jpg" },

  "posts": [
    {
      "id": "1",
      "userName": "Roshan Singh",
      "post": "Today's breakthrough: mastered React hooks like useState, useEffect, useCallback, useReducer, and Context API with TypeScript, crafting a sleek doc-mini-app. Thanks to Framer Motion, card dragging is now effortlessly elegant.",
      "userAvatar": "/avatar1.jpg",
      "label": "sector 2",
      "timeElapsed": "1 min ago",
      "likes": "1k",
      "views": "4k",
      "comments": "2k"
    },
    {
      "id": "2",
      "userName": "Rakesh Kumar",
      "post": "Our new client, Remsons Industries Ltd (NSE Code: REMSONSIND; Mkt Cap Rs695cr) is a pioneer and leading manufacturer of automotive control cables in India. It has a rich legacy of over 5 decades building strong relationship with OEMs across India and globally.",
      "userAvatar": "/avatar2.jpg",
      "label": "sector 2",
      "timeElapsed": "2 min ago",
      "likes": "2k",
      "views": "5k",
      "comments": "3k"
    },
    {
      "id": "3",
      "userName": "Sweta Rathore",
      "post": "Container Freight Triples on Red Sea Conflict The ongoing Red Sea threat from Yemeni rebel group Houthis is having an impact on the supply chain pushing up the charter rates for containers tripling on the Asia to Europe route.",
      "userAvatar": "/avatar3.jpg",
      "label": "sector 2",
      "timeElapsed": "3 min ago",
      "likes": "4k",
      "views": "k",
      "comments": "2k"
    },
    {
      "id": "4",
      "userName": "Hinduja P",
      "post": "Vedanta Ltd has announced a restructuring plan to demerge all it is business verticals into separate listed entities. It is a clean split with existing shareholders of Vedanta Ltd getting one share each of 5 demerged entities.",
      "userAvatar": "/avatar4.jpg",
      "label": "sector 2",
      "timeElapsed": "4 min ago",
      "likes": "2k",
      "views": "4k",
      "comments": "3k"
    },
    {
      "id": "5",
      "userName": "Harshita MV",
      "post": "Today's breakthrough: mastered React hooks like useState, useEffect, useCallback, useReducer, and Context API with TypeScript, crafting a sleek doc-mini-app. Thanks to Framer Motion, card dragging is now effortlessly elegant.",
      "userAvatar": "/avatar5.jpg",
      "label": "sector 2",
      "timeElapsed": "5 min ago",
      "likes": "1k",
      "views": "3k",
      "comments": "2k"
    },
    {
      "id": "6",
      "userName": "Adhiraj M",
      "post": "Good Assets + Strong Management = Winning Business Ambuja Cement is recent announcement to acquire the debt laden Sanghi Industries feels like the same above formula.",
      "userAvatar": "/avatar6.jpg",
      "label": "sector 2",
      "timeElapsed": "6 min ago",
      "likes": "4k",
      "views": "6k",
      "comments": "2k"
    },
    {
      "id": "7",
      "userName": "Visha BH",
      "post": "Once in a while comes a conference call that makes you sit and take notice, and Laxmi Organic Industries Ltd (NSE Code: LXCHEM; Market Cap: 7,160cr) our client companys conf call was one such call.",
      "userAvatar": "/avatar7.jpg",
      "label": "sector 2",
      "timeElapsed": "7 min ago",
      "likes": "1k",
      "views": "4k",
      "comments": "2k"
    }
  ],
  "blogPosts": [
    {
      "id": "1",
      "title": "Coffee Yes, You Maybe.",
      "blog": "Vedanta Ltd has announced a restructuring plan to demerge all it’s business verticals into separate listed entities. It is a clean split with existing shareholders of Vedanta Ltd getting one share each of 5 demerged entities. ",
      "blogImage": "/blog1.jpg"
    },
    {
      "id": "2",
      "title": "Sunrise at horizon",
      "blog": "Good Assets + Strong Management = Winning Business Ambuja Cement’s recent announcement to acquire the debt laden Sanghi Industries feels like the same above formula.",
      "blogImage": "/blog2.jpg"
    },
    {
      "id": "3",
      "title": "Earth on Fire",
      "blog": "Last week, the average global daily temperature made a hat trick of record highs. Global warming is upon us and it is reflected in erratic climate changes. Summers are becoming more intense and so are winters.",
      "blogImage": "/blog3.jpg"
    },
    {
      "id": "4",
      "title": "Hope is back",
      "blog": "China’s upcoming stimulus is talk of the town and this has pulled metal stocks out of the slumber. Metal Index has gone no where in last 6 months but has climbed 5% in last 4 weeks raising hopes of a bigger rally.",
      "blogImage": "/blog4.jpg"
    },
    {
      "id": "5",
      "title": "Data is telling a story",
      "blog": "India Data Centre capacity to double in next 2years India currently has around 800MW of data centre capacity and is growing at 40% cagr and will be touching 1700MW by FY25E.",
      "blogImage": "/blog5.jpg"
    },
    {
      "id": "6",
      "title": "DNA doesn't die",
      "blog": "Well it actually does but a scientific study puts the half life of DNA at 521years, so in ideal conditions, DNA would take 6.8mn years to fully disintegrate. Hi, As an avid reader of our notes, you are aware that we were very bullish on prospects of Ambuja Cement.",
      "blogImage": "/blog6.jpg"
    },
    {
      "id": "7",
      "title": "Ticking all the boxes",
      "blog": "Warren Buffett famously said, “Only when the tide goes out do you discover who’s been swimming.” The recent run on regional US banks post stress due to sharp increase in interest rates tells you the importance of regulation.",
      "blogImage": "/blog7.jpg"
    }
  ]
}
